app/Controllers/Home.php

INSERT INTO `berita` (`id`, `judul`, `slug`, `badan`, `waktu`, `gambar_1`, `gambar_2`, `gambar_3`, `gambar_4`, `gambar_5`, `gambar_6`, `gambar_7`, `gambar_8`, `gambar_9`, `gambar_10`) VALUES ('', 'KONSULTASI PEMBERIAN HONORARIUM UNTUK TIM LINTAS SEKTOR', 'berita-22-6-28-1', 'Tindaklanjut Disposisi Bapak Bupati Hanindhito Himawan Pramana, S.H. terkait Konsultasi Pemberian Honorarium Untuk Tim Lintas Sektor, Selasa, 28 Juni 2022.', '2022-06-28T09:00', 'http://localhost:8080/img/dokumentasi/berita/22-6-28/1.png', 'http://localhost:8080/img/dokumentasi/berita/22-6-28/2.png', 'http://localhost:8080/img/dokumentasi/berita/22-6-28/3.png', 'http://localhost:8080/img/dokumentasi/berita/22-6-28/4.png', '', '', '', '', '', '')
---
    public function tambahberita()
    {
        $modelBerita = model(NewsModel::class);
        if ($this->request->getMethod() === 'post' && $this->validate([
            'id_number' => 'min_length[0]',
            'judul_berita' => 'required|min_length[3]|max_length[255]',
            'slug_berita' => 'required',
            'badan_berita'  => 'required',
            'waktu_berita'  => 'required',
            'gambar1_berita'  => 'required',
            'gambar2_berita'  => 'required',
        ])) {
            $modelBerita->save([
                'id' => $this->request->getPost('id_number'),
                'judul'  => $this->request->getPost('judul_berita'),
                'slug'  => $this->request->getPost('slug_berita'),
                'badan'  => $this->request->getPost('badan_berita'),
                'waktu'  => $this->request->getPost('waktu_berita'),
                'gambar_1'  => $this->request->getPost('gambar1_berita'),
                'gambar_2'  => $this->request->getPost('gambar2_berita'),
            ]);