app/Controllers/Home.php

DELETE FROM `berita`
WHERE `id` IN ('32')
---
    public function hapusberita()
    {
        $modelBerita = model(NewsModel::class);
        if ($this->request->getMethod() === 'post' && $this->validate([
            'id_number' => 'min_length[0]',
        ])) {
            $modelBerita->delete([
                'id' => $this->request->getPost('id_number'),
            ]);